package collection;

public class CollectionBasic {
    /*

    컬렉션 프레임워크 - 다수의 데이터를 관리하기 위해 자바에서 제공하는 기능 사용
    컬렉션 : 데이터 모음집

    컬렉션 프레임워크에는 기본형 자료 저장 불가


    프레임워크가 없다 - 코드를 처음부터 끝까지 다 만들어야함. (느림)
    프레임워크가 있다 - 유용한 코드를 이용하여 불러서 씀. (빠름)


    제공되는 인터페이스
    ( 자료 구조에 따라 데이터의 저장 형태가 달라지기 때문에 4가지 방법을 제공)
    List, Set, Queue, Map
    List - 저장되는 데이터의 특징 : 데이터의 순번이 존재, 데이터의 중복 가능
    ㄴ 배열과 같은 느낌이라 생각하면 편하다.


    Set - 들어가는 데이터의 특징 : 데이터의 순번이 없다, 데이터 중복 불가능
    ㄴ List 와 반대의 개념
    ㄴ for 는 순번이 있어야 사용 가능하기에 사용 불가능


    Stack - 동적이고 순차적인 자료의 목록 ( 넣은 순서대로 차곡차곡 쌓다. )
    ㄴ Stack의 다른 이름 - L.I.F.O
    ㄴ 데이터를 뺄 때는 반대로 맨 마지막에 넣은 것부터 뺄 수 있다.
    ㄴ ex) 들어간 순서 - 1, 2, 3, 4, 5 / 나오는 순서 - 5, 4, 3, 2, 1


    Queue - 스택을 눕힌 것
    ㄴ Queue의 다른 이름 - F.I.F.O


    List 인터페이스를 구현한 클래스
      - ArrayList
      - LinkedList
      ㄴ 위 둘다 그냥 객체 생성해서 쓰면 됨.


    */
}
